ThirdParty/Vangent_HIEOS/src/xtest/test/scripts/testdata/vxcatest/CrossGatewayQueryRequest.soap

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:To>http://xds-ibm.lgs.com:9080/XGatewayWS/RespondingGatewayQuery</wsa:To><wsa:MessageID>urn:uuid:6C02FC25F79DDE2AB71237809276554</wsa:MessageID><wsa:Action>urn:ihe:iti:2007:CrossGatewayQuery</wsa:Action></soapenv:Header><soapenv:Body><query:AdhocQueryRequest xmlns:query="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0"><query:ResponseOption returnComposedObjects="true" returnType="ObjectRef"></query:ResponseOption><AdhocQuery xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">
                        <Slot name="$XDSDocumentEntryPatientId">
                            <ValueList>
                                <Value>'HIMSS01^^^&amp;1.3.6.1.4.1.21367.2009.1.2.300&amp;ISO'</Value>
                            </ValueList>
                        </Slot>
                        <Slot name="$XDSDocumentEntryStatus">
                            <ValueList>
                                <Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</Value>
                            </ValueList>
                        </Slot>
                    </AdhocQuery></query:AdhocQueryRequest></soapenv:Body></soapenv:Envelope>